First, you need to install the `mysql-connector-python` library if you haven't already.

In [ ]:
!pip install mysql-connector-python

Now, here's an example of a helper function to connect to MySQL and read a query into a pandas DataFrame. You'll need to replace the `host`, `user`, `password`, and `database` with your specific MySQL connection details.

In [ ]:
import mysql.connector
import pandas as pd
from google.colab import userdata

# def

def run_mysql_query_to_dataframe(query):
    # Replace with your MySQL database credentials
    mysql_config = {
        'host': userdata.get('db-host'),
        'user': userdata.get('db-user'),
        'password': userdata.get('db-pass'),
        'database': 'sakila'
    }

    try:
        conn = mysql.connector.connect(**mysql_config)
        df = pd.read_sql(query, conn)
        return df
    except mysql.connector.Error as err:
        return pd.DataFrame()
    finally:
        if 'conn' in locals() and conn.is_connected():
            conn.close()

You can now use `run_mysql_query_to_dataframe` with your SQL queries. For example:

In [ ]:
# Example usage (replace with your actual MySQL table and query)
query_mysql = """
SELECT *
FROM actor
LIMIT 5
"""
run_mysql_query_to_dataframe(query_mysql)

## SELECT
```sql
SELECT * FROM table_name; -- displays all data from the table

SELECT column_name_1, column_name_2 FROM table_name; -- displays selected columns

SELECT column_name_1 as "column alias", column_name_2 FROM table_name; -- with alias

SELECT DISTINCT first_name FROM table_name; -- unique **values**

SELECT * FROM table_name LIMIT 10; -- only a few rows
```

### Select - exercises
1. Show all records from the film table
2. Show 10 film titles. Name the title column “Film Title”
3. Show the first 100 values of columns title and rating
4. Show unique first names of all customers
5. Show unique first and last names of all customers
6. Show 10 unique film lengths

In [ ]:
# your turn
# 1. Show all records from the film table
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 2. Show 10 film titles. Name the title column “Film Title”
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 3. Show the first 100 values of columns title and rating
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 4. Show unique first names of all customers
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 5. Show unique first and last names of all customers
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 6. Show 10 unique film lengths
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

## ORDER BY
**ORDER BY** is the keyword used to sort results by specified criteria

## ORDER BY examples
```sql
SELECT col1, col2 FROM table ORDER BY col1 ASC; -- ascending sort

SELECT col1, col2 FROM table ORDER BY col1; -- ascending sort

SELECT col1, col2 FROM table ORDER BY col1 DESC; -- descending sort

SELECT col1, col2 FROM table ORDER BY col1 DESC, col2 ASC; -- sort by multiple columns
```

## ORDER BY - exercises
1. Show the single customer who was added to the customers table most recently
2. Show the first city name alphabetically from the cities table
3. Show film titles ordered descending by film length
4. Show unique film lengths sorted by length ascending

In [ ]:
# your turn
# 1. Show the single customer who was added to the customers table most recently
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 2. Show the first city name alphabetically from the cities table
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 3. Show film titles ordered descending by film length
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 4. Show unique film lengths sorted by length ascending
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

## WHERE
**WHERE** filters the returned records

## WHERE examples
```sql
SELECT * FROM table WHERE col1 = 'abc'; -- equality condition

SELECT * FROM table WHERE col2 > 5; -- inequality condition
-- other allowed operators: <, >=, <=, <> (not equal)

SELECT * FROM table WHERE col2 > 5 AND col2 < 10; -- AND operator
SELECT * FROM table WHERE col2 > 5 OR col2 < 10; -- OR operator
SELECT * FROM table WHERE col2 BETWEEN 10 and 100; -- BETWEEN operator
SELECT * FROM table WHERE col2 IN (1,5,9); -- IN operator

SELECT * FROM table WHERE col2 IS NOT NULL; -- filter NULLs
SELECT * FROM table WHERE col2 IS NULL; -- filter NULLs

SELECT * FROM table WHERE col2 like '%text_fragment%'; -- text pattern matching
```

## WHERE - exercises
1. Show films that are exactly 168 minutes long (4 rows returned)
2. Show films that have length different from 168 minutes (996 rows returned)
3. Show unique payment dates completed after 2005-06-15 (14,299)
4. Show payments made on or before 2005-08-23 with amount = 4.99 (3,748)
5. Show addresses whose postal code equals 17866 or 83579 (using OR) (1)
6. Show addresses whose postal code equals 17866 or 83579 (using IN) (1)

## WHERE - more exercises
1. Show rentals returned between 2005-05-22 and 2006-01-01 exclusive range (15,861)
2. Show rentals returned between 2005-05-22 and 2006-01-01 inclusive range (15,861)
3. Show all rentals that have not yet been returned (183)
4. Show films whose description contains the string 'Database' (76)
5. Show films whose description contains 'MySql' or that have replacement_cost = 9.99 (89)

In [ ]:
# your turn
# 1. Show films that are exactly 168 minutes long (4 rows returned)
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 2. Show films that have length different from 168 minutes (996 rows returned)
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 3. Show unique payment dates completed after 2005-06-15 (14,299)
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 4. Show payments made on or before 2005-08-23 with amount = 4.99 (3,748)
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 5. Show addresses whose postal code equals 17866 or 83579 (using OR) (1)
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)

In [ ]:
# your turn
# 6. Show addresses whose postal code equals 17866 or 83579 (using OR) (1)
query_mysql = """

"""
run_mysql_query_to_dataframe(query_mysql)